In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[12,4,54,3],[1,23,65,3], [3,5,7,4],[96,46,3,5], [12,54,67,3],[12,4,5,3],[12,23,43,45]])

In [3]:
df

    0   1   2   3
0  12   4  54   3
1   1  23  65   3
2   3   5   7   4
3  96  46   3   5
4  12  54  67   3
5  12   4   5   3
6  12  23  43  45

In [4]:
df.shape

(7, 4)

In [5]:
# df.iloc[row, column]

In [6]:
df.iloc[1, 1]

23

In [7]:
df.iloc[3,2]

3

In [8]:
df.iloc[0:3, 0:2] # 0 to 2 rows and 0 to 1 columns

    0   1
0  12   4
1   1  23
2   3   5

In [9]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20],[21,22,23,24]], columns=["A", "B", "C", "D"])

In [10]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24